app/views/events/_buttons_for_event.html.haml

SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 ORDER BY datetime DESC
SELECT 1 AS one FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 AND "events"."id" = 13 LIMIT 1
---
- if user_signed_in?
  - if !current_user.events.include? event

SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 1 AND "events_users"."event_id" = 14 LIMIT 1
---
    %a.btn{onclick: "unattend_event(#{event.id});", class: size} Unattend
    - if current_user.events_users.find_by_event_id(event.id).owner