app/views/events/_infowindow_info.html.haml

SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 2 AND "events_users"."event_id" = 13 LIMIT 1
---
      = image_tag user.image, class: 'avatar img-rounded'
    - if user.events_users.find_by_event_id(event.id).owner