app/views/events/_tags.html.haml

.tags
  - if event.tags.empty?
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.taggable_id = 32 AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT events.id FROM "events" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

    - event.tags.each do |tag|
      - user_may_delete_tag = (current_user.events_users.find_by_event_id(event.id).owner || (event.tags_from(current_user).include? tag.name))
---
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 1 AND "events_users"."event_id" = 33 LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 18
SELECT 1 AS one FROM "tags" WHERE "tags"."name" = 'faa' LIMIT 1