app/controllers/events_controller.rb

  def index
    @events = Array.new
    if params.has_key? :marker
      id = params[:marker]
      @events << Event.find(params[:marker])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "27"]]

  def create
    datetime = get_datetime_or_nil params[:c_date], params[:c_time]
    max_attendees = get_integer_or_inf(params[:c_max_attendees])
    event = {description: params[:c_description],
             address: params[:c_address],
             datetime: datetime,
             max_attendees: max_attendees}
    @event = Event.new(event)
    if user_signed_in? && @event.save
      current_user.events << @event
      @event.update_attribute :number_of_attendees, 1
      current_user.events_users.find_by_event_id(@event.id).update_attribute :owner, true
---
INSERT INTO "events" ("address", "created_at", "datetime", "description", "gmaps", "lat", "lng", "max_attendees", "normalized_address", "number_of_attendees", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 1 AND "events_users"."event_id" = 14 LIMIT 1
UPDATE "events" SET "number_of_attendees" = 1, "updated_at" = '2012-10-22 09:21:43.394824' WHERE "events"."id" = 14
UPDATE "events_users" SET "owner" = 't' WHERE "events_users"."id" = 17

  def add_tag
    @tag_is_blank = false
    tag_to_add = params[:t_tag]
    @event = Event.find(Integer params[:t_event_id])
    if tag_to_add.empty?
      @tag_is_blank = true
    else
      @event.tag_list.add tag_to_add
      @event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 16]]
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'faa' OR lower(name) = 'foo' OR lower(name) = 'spam' OR lower(name) = 'eggs' OR lower(name) = 'bar')
UPDATE "events" SET "normalized_address" = 'Barcelona, Province of Barcelona, Spain', "updated_at" = '2012-11-05 01:10:52.698756' WHERE "events"."id" = 10

  def remove_tag
    @event = Event.find(params[:id])
    if current_user.events_users.find_by_event_id(@event.id).owner
      @event.tag_list.remove params[:tag_name]
      @event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "21"]]
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 1 AND "events_users"."event_id" = 33 LIMIT 1
UPDATE "events" SET "lng" = -74.00597309999999, "updated_at" = '2012-10-24 18:05:07.359242' WHERE "events"."id" = 30

  def update
    @event = Event.find(params[:id])
    @id = params[:id]
    datetime = get_datetime_or_nil params[:e_date], params[:e_time]
    max_attendees = get_integer_or_inf(params[:e_max_attendees])
    event = {description: params[:e_description],
             address: params[:e_address],
             datetime: datetime,
             max_attendees: max_attendees}
    if user_signed_in? && current_user.events_users.find_by_event_id(@event.id).owner
      @event.update_attributes(event)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "29"]]
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 5 AND "events_users"."event_id" = 29 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
UPDATE "events" SET "address" = 'paris', "lng" = 2.3522219, "lat" = 48.856614, "normalized_address" = 'Paris, France', "updated_at" = '2012-10-24 18:03:29.027935' WHERE "events"."id" = 29

  def infowindow
    baseURI = request.host_with_port
    url_params = {marker: params[:id]}
    @perma_link = 'http://'+baseURI+'/?'+url_params.to_query
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "13"]]

  def attend
    @errors = Array.new
    @event = Event.find(params[:id])
    @success = false
    if user_signed_in? && !(@event.users.include? current_user) && (@event.users.length < @event.max_attendees)
      @event.users << current_user
      @event.update_attribute :number_of_attendees, @event.number_of_attendees+1
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "13"]]
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 13
SELECT 1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 13 AND "users"."id" = 1 LIMIT 1
UPDATE "events" SET "number_of_attendees" = 2, "updated_at" = '2012-10-22 09:07:43.434970' WHERE "events"."id" = 13

  def all_events
    @events = current_user.events.order('datetime DESC')
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 ORDER BY datetime DESC

  def past_events
    @events = current_user.events.order('datetime DESC')
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 ORDER BY datetime DESC

  def present_events
    @events = current_user.events.order('datetime DESC')
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 5 ORDER BY datetime DESC

  def my_events
    @events = current_user.events.order('datetime DESC')
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 ORDER BY datetime DESC

  def add_owner
    event = Event.find(params[:id])
    user = User.find(params[:u_id])
    user.events_users.find_by_event_id(event.id).update_attribute :owner, true
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "13"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 1 AND "events_users"."event_id" = 13 LIMIT 1
UPDATE "events_users" SET "owner" = 't' WHERE "events_users"."id" = 16

  def remove_owner
    event = Event.find(params[:id])
    user = User.find(params[:u_id])
    user.events_users.find_by_event_id(event.id).update_attribute :owner, false
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "13"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "events_users".* FROM "events_users" WHERE "events_users"."user_id" = 2 AND "events_users"."event_id" = 13 LIMIT 1
UPDATE "events_users" SET "owner" = 'f' WHERE "events_users"."id" = 15

  def destroy
    @event = Event.find(params[:id])
    @id = params[:id]
    if current_user.events.include? @event
      @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "29"]]
SELECT 1 AS one FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 5 AND "events"."id" = 29 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 29]]