app/controllers/events_controller.rb

  def add_tag
    @tag_is_blank = false
    tag_to_add = params[:t_tag]
    @event = Event.find(Integer params[:t_event_id])
    if tag_to_add.empty?
      @tag_is_blank = true
    else
      @event.tag_list << tag_to_add
---
INSERT INTO "tags" ("name") VALUES ($1) RETURNING "id"  [["name", "eggs"]]